package SchoolRecruit.didi2018;

/********************************************************************************
 * CodingInterviewGuide -- 校招·滴滴2018
 * @version 2017/09/28 11:02
 * @author xitangking, xtwyzh@gmail.com,xtwroot.com
 * xtwroot Copyrights (c) 2017. All rights reserved.
 ********************************************************************************/

/*
 *【题目】
 * 给定无序整数序列，求连续子串最大和，例如{-23 17 -7 11 -2 1 34}，子串为{17,-7,11}，最大和为21
 * 输入描述:
 * 输入为整数序列，数字用空格分隔，如：-23 17 -7 11 -2 1 -34
 * 输出描述:
 * 输出为子序列的最大和：21
 *
 * 示例1
 * 输入
 * -23 17 -7 11 -2 1 -34
 * 输出
 * 21
 */


public class Problem_03 {
}
