package SchoolRecruit.didi2018;

/********************************************************************************
 * CodingInterviewGuide -- 校招·滴滴2018
 * @version 2017/09/28 11:02
 * @author xitangking, xtwyzh@gmail.com,xtwroot.com
 * xtwroot Copyrights (c) 2017. All rights reserved.
 ********************************************************************************/

/*
 *【题目】
 * 给定无序整数序列，求其中第K大的数，例如{45，67，33，21}， 第2大数为45
 *
 * 输入描述:
 * 输入第一行为整数序列，数字用空格分隔，如：45 67 33 21 输入第二行一个整数K，K在数组长度范围内，如：2
 *
 * 输出描述:
 * 输出第K大的数，本例为第2大数：45
 *
 *【示例】
 * 输入 45 67 33 21 2
 * 输出45
 *
 */

public class Problem_04 {
}
